from telegram.ext import ConversationHandler

(
    VIEW, TASK, DELETE_TASK, DESCRIPTION, TAG, FREQUENCY, CONFIRM,
    RESOURCE, ADD, REPORT, PRICE, INSERT_TAG, START, DUE,
    INSERT_RESOURCE, UPDATE, EDIT, AMOUNT, REMOVE, EXPIRY,
    EDIT_AMOUNT, SEARCH, TITLE, COMMENT, SUMMARY, EDIT_TASK, REPLACE,
    SETTINGS, PARITY, PANTRY,REPLACE, RESTART, UNIT, UNTIL
) = map(chr, range(34))

END = ConversationHandler.END

token = ''

timings_dict = {
    "Fajr": "نماز صبح",
    "Dhuhr": "نماز ظهر",
    "Asr": "نماز عصر", 
    "Maghrib": "نماز مغرب",
    "Isha": "نماز عشاء"
}


help_dict = {
    'main': '''
1- هر فعالیت میتواند موجب افزایش یا کاهش یک منبع شود
2- دفعات استفاده  از منابع توسط فعالیت ها مشخص می شود
3- منابع به 4 گروه مصرفی، سرمایه ای، خدماتی و مدت دار تقسیم می شوند
4- هر منبع بایستی به صورت یکتا بوده و ارزش تومانی آن مشخص شود
5- منابع مصرفی بر اساس میزان استفاده کاهش پیدا می کنند
6- منابع مدت دار زمان استهلاک (انقضای مصرف) دارند که با تاریخ فعالیتی با عنوان "استهلاک منبع ...." منقضی می گردند
7- منابع خدماتی زمان دار (حقوق، وام ها و موارد مشابه) در ابتدا به تعداد دفعات به فعالیت مربوطه اضافه شده، سپس در طول مدت زمان انجام کاهش یافته و معادل تومانی آن ها به منابع سرمایه ای اضافه می گردد. به عنوان مثال:
حقوق: ایجاد فعالیت با عنوان انعقاد قرارداد، افزودن منبع خدماتی با عنوان مربوطه، مشخص نمودن قیمت تومانی هر پریود زمانی، اضافه کردن تعداد خدمات بر اساس مدت زمان کل قرار داد به فعالیت مذکور (مثلا 12 واحد برای حقوق، 12 واحد برای اضافه کاری، یک واحد عیدی) کاهش هر واحد در زمان سررسید، افزودن معادل تومانی به منبع سرمایه ای مرتبط)
وام: ایجاد فعالیت با عنوان دریافت وام .....، افزودن منبع خدماتی با عنوان مربوطه، مشخص نمودن میزان تعهد مالی هر پریود زمانی، کم کردن تعداد دفعات بر اساس دفعات قسط افزودن مبلغ وام به منبع سرمایه ای مرتبط، کم کردن کارمزدها از منبع سرمایه ای مرتبط (در صورت تکرار این خود به عنوان هزینه کارمزد وام به عنوان یک منبع خدماتی افزوده می شود)، افزایش یک واحد تعهد پرداخت شده، کاهش معادل تومانی از منبع سرمایه ای مربوطه)
'''
}